Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.SecondaryType Enumeration
 Defines how many secondaries a connection can have.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SecondaryType
Public Enumeration SecondaryType
Members
Member name | Value | Description
SECONDARYTYPE_ZERO | 0 |  The connection can have zero secondaries. Zero secondaries means that the connection is a detail.
SECONDARYTYPE_ONE | 1 |  The connection can have one secondary.
SECONDARYTYPE_TWO | 2 |  The connection can have two secondaries.
SECONDARYTYPE_MULTIPLE | 3 |  The connection can have multiple secondaries.
See Also
Reference
Tekla.Structures.Plugins Namespace